In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df=pd.read_csv('employee_data.csv')
df.head()

   EmployeeID             Name  Department    Salary JoiningDate      Status
0        7970              NaN  Operations   44168.0  2023-04-16  Terminated
1        1752   Shannon Franco          HR   80140.0  2016-08-22  Terminated
2        8478              NaN          HR  144316.0  2023-11-04  Terminated
3        5157  Barbara Alvarez  Operations   35075.0  2023-04-22         NaN
4        1816        Adam Cobb       Sales  142537.0  2016-05-12      Active

In [6]:
df.info

<bound method DataFrame.info of      EmployeeID               Name   Department    Salary JoiningDate  \
0          7970                NaN   Operations   44168.0  2023-04-16
1          1752     Shannon Franco           HR   80140.0  2016-08-22
2          8478                NaN           HR  144316.0  2023-11-04
3          5157    Barbara Alvarez   Operations   35075.0  2023-04-22
4          1816          Adam Cobb        Sales  142537.0  2016-05-12
..          ...                ...          ...       ...         ...
495        2862                NaN   Operations   83271.0  2019-03-19
496        3910    Douglas English  Engineering   94038.0  2022-09-23
497        1009                NaN        Sales  102768.0  2023-03-24
498        3062  Christopher Perry          NaN  129374.0  2023-12-01
499        3252     Amanda Goodwin   Operations   61499.0  2020-07-18

         Status
0    Terminated
1    Terminated
2    Terminated
3           NaN
4        Active
..          ...
495      Active
496    Resigned
497      Active
498  Terminated
499         NaN

[500 rows x 6 columns]>

In [7]:
df.dtypes

EmployeeID       int64
Name            object
Department      object
Salary         float64
JoiningDate     object
Status          object
dtype: object

In [4]:
df.isna().sum()

EmployeeID      0
Name           50
Department     50
Salary         50
JoiningDate    50
Status         50
dtype: int64

In [13]:
df.head(4)

(   EmployeeID             Name  Department    Salary JoiningDate      Status
 0        7970              NaN  Operations   44168.0  2023-04-16  Terminated
 1        1752   Shannon Franco          HR   80140.0  2016-08-22  Terminated
 2        8478              NaN          HR  144316.0  2023-11-04  Terminated
 3        5157  Barbara Alvarez  Operations   35075.0  2023-04-22         NaN,
 (500, 6))

In [14]:
df.shape

(500, 6)

In [18]:
df.Salary.mean()

92814.08666666667

# Filling the na values

In [21]:
df['Salary']=df.Salary.fillna(df.Salary.mean())

In [26]:
df.Department.mode()[0]
df['Department']=df.Department.fillna(df.Department.mode()[0])

In [32]:
df.JoiningDate.mode()[0]
df['JoiningDate']=df.JoiningDate.fillna(df.JoiningDate.mode()[0])

In [36]:
df.Status.mode()[0]
df['Status']=df.Status.fillna(df.Status.mode()[0])

In [40]:
df.Name.mode()[0]

'Elizabeth Johnson'

In [41]:
df.Name.mode()[0]
df['Name']=df.Name.fillna(df.Name.mode()[0])
# filling the name columns with mode value to avoid data wastage

In [38]:
df.head()

   EmployeeID             Name  Department    Salary JoiningDate      Status
0        7970              NaN  Operations   44168.0  2023-04-16  Terminated
1        1752   Shannon Franco          HR   80140.0  2016-08-22  Terminated
2        8478              NaN          HR  144316.0  2023-11-04  Terminated
3        5157  Barbara Alvarez  Operations   35075.0  2023-04-22  Terminated
4        1816        Adam Cobb       Sales  142537.0  2016-05-12      Active

In [39]:
df.isna().sum()

EmployeeID      0
Name           50
Department      0
Salary          0
JoiningDate     0
Status          0
dtype: int64

# finding duplicate values in dataframe

In [45]:
df.duplicated().sum()

0

In [47]:
df['Status'].unique()

array(['Terminated', 'Active', 'Resigned', 'On Leave'], dtype=object)

# Filtering out the employees with resigned status in df_resigned dataframe

In [51]:
df_resigned=df[df['Status']=='Resigned']
df_resigned.head()

,EmployeeID,Name,Department,Salary,JoiningDate,Status
5,7766,Tyrone Miller,Engineering,92814.086667,2023-08-21,Resigned
9,1255,Elizabeth Johnson,HR,90332.000000,2015-04-23,Resigned
10,4786,Loretta Espinoza,Operations,75830.000000,2014-12-24,Resigned
12,4245,Jamie Aguilar,Finance,137549.000000,2015-06-26,Resigned
14,7189,Andrew Zimmerman,Finance,144206.000000,2015-09-17,Resigned

# Analysis

In [57]:
df.groupby('Department')['Salary'].agg('mean') 
# finding the average salary across each Department

Department
Engineering    97696.495967
Finance        92700.282857
HR             92043.128148
Marketing      86130.513000
Operations     95040.411917
Sales          91922.676816
Name: Salary, dtype: float64

# Result

In [69]:
df.head()

   EmployeeID               Name  Department    Salary JoiningDate      Status
0        7970  Elizabeth Johnson  Operations   44168.0  2023-04-16  Terminated
1        1752     Shannon Franco          HR   80140.0  2016-08-22  Terminated
2        8478  Elizabeth Johnson          HR  144316.0  2023-11-04  Terminated
3        5157    Barbara Alvarez  Operations   35075.0  2023-04-22  Terminated
4        1816          Adam Cobb       Sales  142537.0  2016-05-12      Active

In [71]:
df.isna().sum()

EmployeeID     0
Name           0
Department     0
Salary         0
JoiningDate    0
Status         0
dtype: int64

In [72]:
df.duplicated().sum()

0

In [73]:
df_resigned.head()

,EmployeeID,Name,Department,Salary,JoiningDate,Status
5,7766,Tyrone Miller,Engineering,92814.086667,2023-08-21,Resigned
9,1255,Elizabeth Johnson,HR,90332.000000,2015-04-23,Resigned
10,4786,Loretta Espinoza,Operations,75830.000000,2014-12-24,Resigned
12,4245,Jamie Aguilar,Finance,137549.000000,2015-06-26,Resigned
14,7189,Andrew Zimmerman,Finance,144206.000000,2015-09-17,Resigned